#include <iostream>
#include <string>
using namespace std;

// Функція Count приймає рядок s типу string та підраховує кількість входжень символів '+', '-', та '=' у цьому рядку.
int Count(const string s)
{
    int k = 0;  // Лічильник кількості символів.

    // Цикл, який проходить крізь кожен символ у рядку s.
    for (char c : s)
    {
        // Якщо поточний символ - один із символів '+', '-', або '=', збільшуємо лічильник.
        if (c == '+' || c == '-' || c == '=')
        {
            k++;
        }
    }
    return k;  // Повертаємо кількість знайдених символів.
}

// Функція Change приймає рядок s типу string та замінює символи '+', '-', та '=' на два символи '**'.
// Заміщений рядок повертається як результат, а оригінальний рядок s змінюється через посилання.
string Change(string& s)
{
    size_t pos = 0;  // Змінна для збереження позиції знайденого символу.

    // Цикл, який знаходить кожен символ '+' або '-' або '=' у рядку s і замінює його на '**'.
    while ((pos = s.find_first_of("+-=", pos)) != string::npos)
    {
        s.replace(pos, 1, "**");  // Заміна символу на два '**'.
        pos += 2;  // Перехід до наступної позиції для пошуку.
    }
    return s;  // Повертаємо модифікований рядок.
}

int main()
{
    string str;
    cout << "Enter string:" << endl;

    // Введення рядка з консолі.
    getline(cin, str);

    // Виклик функції Count для підрахунку кількості символів у введеному рядку.
    int count = Count(str);
    cout << "Total occurrences " << count << " znakiv '+', '-', '=': " << endl;

    // Виклик функції Change для модифікації рядка str та отримання результату у dest.
    string dest = Change(str);

    // Виведення модифікованого рядка (параметр) та модифікованого рядка (результат).
    cout << "Modified string (param) : " << str << endl;
    cout << "Modified string (result): " << dest << endl;

    return 0;
}
